Repository: PonyPaPony/MealsCalculator
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Error
ru: Ошибка

source: Non-existent language.
ru: Не существующий язык.

source: Success
ru: Успех

source: Failed to record {f}
ru: Не удалось записать {f}.

source: Read error {f}. Loading default data
ru: Ошибка чтения {f}. Загружаем дефолтные данные

source: Error Occurred: {error}
ru: Произошла Ошибка: {error}

source: Error: Tkinter instance not specified.
ru: Ошибка: Не указан экземпляр Tkinter.

source: Icon {icon_path} was not found. The default icon is used.
ru: Иконка {icon_path} не найдена. Используется стандартная иконка.

source: Incorrect data format for saving.
ru: Некорректный формат данных для сохранения.

source: Data stored in {file_path}
ru: Данные сохранены в {file_path}

source: Language settings reset!
ru: Языковые настройки сброшены!

source: Info
ru: Инфо

source: The application will be closed.
ru: Приложение будет закрыто.

source: Success: Language settings have been reset.
ru: Успешно: языковые настройки сброшены.

source: Language Selected: {language_code}
ru: Выбранный язык: {language_code}

source: Translation file not found.
ru: Файл перевода не найден.

source: The tkinter instance does not exist.
ru: Экземпляр tkinter не существует.

source: Calculate calories
ru: Рассчитать калории

source: Product management menu
ru: Меню управления продуктами

source: Show Stats
ru: Показать статистику

source: Exit
ru: Выход

source: Reset Language Settings
ru: Cбросить Языковые Настройки

source: Main Menu
ru: Главное Меню

source: No products for calculation.
ru: Нет продуктов для расчёта.

source: + Add product
ru: + Добавить продукт

source: Calculate
ru: Рассчитать

source: Back
ru: Назад

source: Add product
ru: Добавить продукт

source: Delete product
ru: Удалить продукт

source: Change Calories
ru: Изменить Калорийность

source: Back to menu
ru: Назад в меню

source: Product name:
ru: Название продукта:

source: Calories:
ru: Калорийность:

source: Attention
ru: Внимание

source: This product already exists.
ru: Такой продукт уже существует.

source: The product filed cannot be empty.
ru: Поле продукта не может быть пустым.

source: Added {n} with {kcal} calories.
ru: Добавлен {n} с калорийностью {kcal}.

source: Incorrect calories format.
ru: Неверный формат калорийности.

source: Save
ru: Сохранить

source: Product to delete:
ru: Продукт для удаления:

source: Enter product name.
ru: Введите название продукта.

source: {name} has been deleted.
ru: Продукт {name} удалён.

source: The product {name} is not found.
ru: Продукт {name} не найден.

source: Delete
ru: Удалить

source: Change calories
ru: Изменить калорийность

source: Product:
ru: Продукт:

source: New calories:
ru: Новая калорийность:

source: The product {n} was not found.
ru: Продукт {n} не найден.

source: Enter calories for product.
ru: Введите калории для продукта.

source: {n} calories have been updated.
ru: Калорийность {n} обновлена.

source: Change
ru: Изменить

source: Products saved!
ru: Продукты сохранены!

source: Name and calories are required.
ru: Название и калорийность обязательны.

source: Calories {kcal} are not a number.
ru: Калорийность {kcal} не является числом.

source: {name} is not found in the database.
ru: Продукт '{name}' не найден в базе.

source: Result
ru: Результат

source: App Launched
ru: Приложение Запущено
